app/Controllers/Assets.php

    public function index()
    {
        $data = array();
        $data['filter_search'] =  false;
        if ($this->request->getVar('search') || $this->request->getVar('filter')) {
            $data['filter_search'] =  true;

            $builder = $this->db->table('tbl_assets');
            $builder->join('tbl_brand', 'tbl_brand.id_brand=tbl_assets.brand_id', 'left');
            $builder->join('tbl_location', 'tbl_location.id_location=tbl_assets.location_id', 'left');
            $builder->join('tbl_category', 'tbl_category.id_category=tbl_assets.category_id', 'left');
            $builder->join('tbl_main_category', 'tbl_main_category.id_main_category=tbl_assets.main_category_id', 'left');
            $builder->join('tbl_status', 'tbl_status.id_status=tbl_assets.status_id', 'left');
            $builder->join('tbl_condition', 'tbl_condition.id_condition=tbl_assets.condition_id', 'left');
            $builder->join('tbl_type_brand', 'tbl_type_brand.id_type_brand=tbl_assets.type_brand_id', 'left');

            if ($this->request->getVar('search')) $builder->like('tbl_assets.name_assets', $this->request->getVar('assets'));
            if ($this->request->getVar('filter')) {

                // dd($this->request->getVar());

                if ($this->request->getVar('main_category_id') != 0) $builder->where('tbl_assets.main_category_id', $this->request->getVar('main_category_id'));
                if ($this->request->getVar('category_id') != 0) $builder->where('tbl_assets.category_id', $this->request->getVar('category_id'));
                if ($this->request->getVar('location_id') != 0) $builder->where('tbl_assets.location_id', $this->request->getVar('location_id'));
                if ($this->request->getVar('condition_id') != 0) $builder->where('tbl_assets.condition_id', $this->request->getVar('condition_id'));
                if ($this->request->getVar('type_brand_id') != 0) $builder->where('tbl_assets.type_brand_id', $this->request->getVar('type_brand_id'));
            }
            $results = $builder->get()->getResultArray();
        } else {
            $results = $this->modelAssets->select('*')
                ->join('tbl_brand', 'tbl_brand.id_brand=tbl_assets.brand_id', 'left')
                ->join('tbl_location', 'tbl_location.id_location=tbl_assets.location_id', 'left')
                ->join('tbl_category', 'tbl_category.id_category=tbl_assets.category_id', 'left')
                ->join('tbl_main_category', 'tbl_main_category.id_main_category=tbl_assets.main_category_id', 'left')
                ->join('tbl_status', 'tbl_status.id_status=tbl_assets.status_id', 'left')
                ->join('tbl_condition', 'tbl_condition.id_condition=tbl_assets.condition_id', 'left')
                ->join('tbl_type_brand', 'tbl_type_brand.id_type_brand=tbl_assets.type_brand_id', 'left')
                ->paginate(6, 'tbl_assets');
---
SELECT *
FROM `tbl_assets`
LEFT JOIN `tbl_brand` ON `tbl_brand`.`id_brand`=`tbl_assets`.`brand_id`
LEFT JOIN `tbl_location` ON `tbl_location`.`id_location`=`tbl_assets`.`location_id`
LEFT JOIN `tbl_category` ON `tbl_category`.`id_category`=`tbl_assets`.`category_id`
LEFT JOIN `tbl_main_category` ON `tbl_main_category`.`id_main_category`=`tbl_assets`.`main_category_id`
LEFT JOIN `tbl_status` ON `tbl_status`.`id_status`=`tbl_assets`.`status_id`
LEFT JOIN `tbl_condition` ON `tbl_condition`.`id_condition`=`tbl_assets`.`condition_id`
LEFT JOIN `tbl_type_brand` ON `tbl_type_brand`.`id_type_brand`=`tbl_assets`.`type_brand_id`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tbl_assets`
LEFT JOIN `tbl_brand` ON `tbl_brand`.`id_brand`=`tbl_assets`.`brand_id`
LEFT JOIN `tbl_location` ON `tbl_location`.`id_location`=`tbl_assets`.`location_id`
LEFT JOIN `tbl_category` ON `tbl_category`.`id_category`=`tbl_assets`.`category_id`
LEFT JOIN `tbl_main_category` ON `tbl_main_category`.`id_main_category`=`tbl_assets`.`main_category_id`
LEFT JOIN `tbl_status` ON `tbl_status`.`id_status`=`tbl_assets`.`status_id`
LEFT JOIN `tbl_condition` ON `tbl_condition`.`id_condition`=`tbl_assets`.`condition_id`
LEFT JOIN `tbl_type_brand` ON `tbl_type_brand`.`id_type_brand`=`tbl_assets`.`type_brand_id`


        $data['assets'] = $results;

        $data['location'] = $this->modelLocation->findAll();
        $data['brand'] = $this->modelBrand->findAll();
        $data['category'] = $this->modelCategory->findAll();
        $data['condition'] = $this->modelCondition->findAll();
        $data['status'] = $this->modelStatus->findAll();
        $data['type_brand'] = $this->modelTypeBrand->select('*')->join('tbl_brand', 'tbl_type_brand.brand_id = tbl_brand.id_brand')->findAll();;
        $data['main_category'] = $this->modelMainCategory->findAll();
---
SELECT *
FROM `tbl_location`
SELECT *
FROM `tbl_brand`
SELECT *
FROM `tbl_category`
SELECT *
FROM `tbl_condition`
SELECT *
FROM `tbl_status`
SELECT *
FROM `tbl_type_brand`
JOIN `tbl_brand` ON `tbl_type_brand`.`brand_id` = `tbl_brand`.`id_brand`
SELECT *
FROM `tbl_main_category`